#!/usr/bin/env python3
# mapper_tfidf.py — финальная версия (без stderr-хака)

import sys
import math
import os

test_data = [
  "аааа\t1337112293\t6.438693975314047e-06\t1",
  "ааааа\t1337112293\t1.2877387950628095e-05\t1",
  "аамилопектин\t1337112293\t6.438693975314047e-06\t1",
  "аассивно\t1337112293\t6.438693975314047e-06\t1",
  "абакумов\t1337112293\t6.438693975314047e-06\t1",
  "аббревиатура\t1293336984\t7.853177002756465e-06\t2",
  "аббревиатура\t1337112293\t1.2877387950628095e-05\t2",
  "аббревиатуру\t1293336984\t7.853177002756465e-06\t1",
  "аббревиатуры\t1293336984\t7.853177002756465e-06\t2",
  "аббревиатуры\t1337112293\t6.438693975314047e-06\t2",
  "абдулла\t1293336984\t7.853177002756465e-06\t1",
  "абзац\t1337112293\t6.438693975314047e-06\t1",
  "абонемент\t1293336984\t3.141270801102586e-05\t1",
  "абонементе\t1293336984\t7.853177002756465e-06\t1",
  "абонементом\t1293336984\t7.853177002756465e-06\t1",
  "абонентская\t1293336984\t7.853177002756465e-06\t1",
  "аборты\t1337112293\t6.438693975314047e-06\t1",
  "абразивы\t1337112293\t1.2877387950628095e-05\t1",
  "абрамченко\t1293336984\t4.711906201653879e-05\t1",
  "абрау\t1337112293\t6.438693975314047e-06\t1"
]


# Берём общее количество документов из переменной окружения
# Мы передадим её через -cmdenv TOTAL_DOCS=XXXXXX в run_step2
total_docs = int(os.getenv("TOTAL_DOCS", "2"))
print('total_docs:', total_docs)

for line in sys.stdin:
# for line in test_data:
    line = line.strip()
    if not line:
        continue
    try:
        word, channel_id, tf_str, df_str = line.split('\t')
        tf = float(tf_str)
        df = int(df_str)

        # Сглаженный IDF: log(N / (df + 1))
        # idf = math.log(total_docs / (df + 1))
        idf = math.log((total_docs + 1) / (df + 1))
        tfidf = tf * idf

        print(f"{channel_id}\t{word}\t{tfidf:.6f}")
    except Exception as e:
        continue  # молча пропускаем битые строки